{
  "global": {
    "title": "U-Dig It AI Support Knowledge Base",
    "description": "Structured help center framework including FAQs, troubleshooting guides, tutorials, and escalation paths.",
    "tone": "clear, friendly, solution-focused",
    "guardrails": "Responses must be accurate, concise, and encourage self-service before escalation."
  },
  "faq_categories": {
    "account_billing": [
      {
        "q": "How do I update my payment method?",
        "a": "You can update billing details anytime through the Stripe Customer Portal: {{STRIPE_PORTAL_LINK}}."
      },
      {
        "q": "Can I get a refund?",
        "a": "Yes, we offer a 30-day money back guarantee. Contact support at nickbaxter@udigit.ca."
      },
      {
        "q": "How do I cancel my subscription?",
        "a": "You can cancel anytime via the Stripe Customer Portal: {{STRIPE_PORTAL_LINK}}. Your access will continue until the end of the billing cycle."
      }
    ],
    "product_access": [
      {
        "q": "Where do I find my purchased templates?",
        "a": "Access links are emailed immediately after purchase. If you don’t see them, check your spam folder or contact support."
      },
      {
        "q": "Do I get updates to templates?",
        "a": "Yes — product updates are included. For Hub and Vault customers, new templates are added regularly."
      }
    ],
    "technical": [
      {
        "q": "I didn’t receive my access email. What should I do?",
        "a": "Check your spam folder. If not found, contact nickbaxter@udigit.ca and we’ll resend your access link."
      },
      {
        "q": "Some templates aren’t working correctly. How do I fix this?",
        "a": "Ensure you’re copying them into the right AI platform (e.g., ChatGPT, Claude). If issues persist, email support with details."
      }
    ]
  },
  "troubleshooting_guides": {
    "common_issues": [
      {
        "issue": "Payment failed",
        "steps": [
          "Check that your card is valid and has sufficient funds.",
          "Try a different payment method.",
          "Contact your bank if the issue persists.",
          "Retry checkout via Stripe link: {{PRODUCT_PAYMENT_LINK}}"
        ]
      },
      {
        "issue": "Access link expired",
        "steps": [
          "Check your original email for a valid link.",
          "If expired, request a new one via support: nickbaxter@udigit.ca"
        ]
      }
    ]
  },
  "tutorials": {
    "getting_started": {
      "title": "🚀 Getting Started With {{PRODUCT_TITLE}}",
      "steps": [
        "Step 1: Open your access email and download templates.",
        "Step 2: Import them into your AI platform (ChatGPT, Claude, etc).",
        "Step 3: Try your first workflow — most users see results within 20 minutes."
      ]
    },
    "advanced": {
      "title": "⚡ Power User Tips",
      "steps": [
        "Use templates across multiple workflows.",
        "Customize prompts to fit your business context.",
        "Stack {{PRODUCT_TITLE}} with {{UPSELL_PRODUCT}} for exponential results."
      ]
    }
  },
  "escalation": {
    "first_contact": "Direct to support email: nickbaxter@udigit.ca",
    "sla": "Replies within 24h weekdays, 48h weekends",
    "next_step": "If unresolved, escalate to senior support specialist",
    "final_step": "Offer refund or custom solution if issue persists"
  },
  "integration": {
    "placement": ["help_center_page", "footer.links", "community_channel.support"],
    "reporting": "Track most-viewed articles and unresolved issues in reporting_dashboard_spec.json",
    "feedback_loop": "Update FAQs and guides based on customer_feedback_playbook.json"
  }
}
